In [19]:
import pandas as pd
import numpy as np
import random 
import os


os.getcwd()
os.chdir('/home/meric/Desktop/csv')

df = pd.DataFrame({'key1' : ['a','a','b','b','a'],
               'key2' : ['one', 'two', 'one', 'two', 'one'],
               'data1' : abs(np.random.randn(5)*100),
               'data2' : abs(np. random.randn(5)*100)})

df

  key1 key2      data1       data2
0    a  one  28.578018  122.151093
1    a  two  25.230792   40.823322
2    b  one  42.977730   11.302730
3    b  two  58.213827   28.171211
4    a  one  45.739346    5.764976

In [22]:
df_result=df.assign(
 result1 = np.where(df['key2']=='one',df.data1,0),
 result2 = np.where(df['key2']=='two',df.data1,0)
  ).groupby('key1').agg({'result1':sum, 'result2':sum})

df_result

        result1    result2
key1
a     74.317364  25.230792
b     42.977730  58.213827

In [21]:
df.to_excel (r'Df_Source_SumCaseWhen.xlsx', index = False, header=True)
df_result.to_excel (r'Df_Result_SumCaseWhen.xlsx', index = False, header=True)